In [1]:
import pandas as pd

In [3]:
# step 1- reading the user data final file

users_data = pd.read_pickle("../../week11/data/users_data_final.pkl")

In [4]:
users_data.head()

,user_id,number_transactions,total_amount_usd,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,term_deposit,date_joined,device
0,9231c446-cb16-4b2b-a7f7-ddfc8b25aaf6,3.0,2143.0,58,management,married,tertiary,False,True,False,None,261,1,-1,0,None,False,1998-08-23,mobile
1,bb92765a-08de-4963-b432-496524b39157,NaN,NaN,44,technician,single,secondary,False,True,False,None,151,1,-1,0,None,False,2008-07-15,desktop
2,573de577-49ef-42b9-83da-d3cfb817b5c1,2.0,2.0,33,entrepreneur,married,secondary,False,True,True,None,76,1,-1,0,None,False,2002-06-04,mobile
3,d6b66b9d-7c8f-4257-a682-e136f640b7e3,NaN,NaN,47,blue-collar,married,None,False,True,False,None,92,1,-1,0,None,False,1995-06-29,tablet
4,fade0b20-7594-4d9a-84cd-c02f79b1b526,1.0,1.0,33,None,single,None,False,False,False,None,198,1,-1,0,None,False,1995-08-01,mobile

In [5]:
users_data.shape

(45209, 19)

In [6]:
users_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 45209 entries, 0 to 45215
Data columns (total 19 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   user_id              45209 non-null  object
 1   number_transactions  35210 non-null  float64
 2   total_amount_usd     35210 non-null  float64
 3   age                  45209 non-null  int64
 4   job                  44921 non-null  object
 5   marital              45209 non-null  object
 6   education            43352 non-null  object
 7   default              45209 non-null  bool
 8   housing              45209 non-null  bool
 9   loan                 45209 non-null  bool
 10  contact              32191 non-null  object
 11  duration             45209 non-null  int64
 12  campaign             45209 non-null  int64
 13  pdays                45209 non-null  int64
 14  previous             45209 non-null  int64
 15  poutcome             8252 non-null   object
 16  term_deposit         45209 non-null  bool
 17  date_joined          45179 non-null  datetime64[ns]
 18  device               45115 non-null  object
dtypes: bool(4), datetime64[ns](1), float64(2), int64(5), object(7)
memory usage: 5.7+ MB

In [14]:
# question: how many columns have the data type object?

list(users_data.select_dtypes(['object']).columns)

['user_id', 'job', 'marital', 'education', 'contact', 'poutcome', 'device']

In [12]:
len(users_data.select_dtypes(['object']).columns)

7

In [13]:
print("The number of columns with data type object is", len(users_data.select_dtypes(['object']).columns))

The number of columns with data type object is 7

In [15]:
# question: how many columns have the data type int, float and bool?

list(users_data.select_dtypes(['int64', 'float64', 'bool']).columns)

['number_transactions',
 'total_amount_usd',
 'age',
 'default',
 'housing',
 'loan',
 'duration',
 'campaign',
 'pdays',
 'previous',
 'term_deposit']

In [16]:
len(list(users_data.select_dtypes(['int64', 'float64', 'bool']).columns))

11

In [20]:
print("The number of columns with data type object is", len(list(users_data.select_dtypes(['int64', 'float64', 'bool']).columns)))

The number of columns with data type object is 11

In [24]:
# question: were there are duplicate rows of data?

users_data[users_data.duplicated()]

Empty DataFrame
Columns: [user_id, number_transactions, total_amount_usd, age, job, marital, education, default, housing, loan, contact, duration, campaign, pdays, previous, poutcome, term_deposit, date_joined, device]
Index: []

In [25]:
users_data.duplicated().sum()

np.int64(0)

In [26]:
users_data.isnull().sum()

user_id                    0
number_transactions     9999
total_amount_usd        9999
age                        0
job                      288
marital                    0
education               1857
default                    0
housing                    0
loan                       0
contact                13018
duration                   0
campaign                   0
pdays                      0
previous                   0
poutcome               36957
term_deposit               0
date_joined               30
device                    94
dtype: int64

In [27]:
users_data.isnull().mean()

user_id                0.000000
number_transactions    0.221173
total_amount_usd       0.221173
age                    0.000000
job                    0.006370
marital                0.000000
education              0.041076
default                0.000000
housing                0.000000
loan                   0.000000
contact                0.287952
duration               0.000000
campaign               0.000000
pdays                  0.000000
previous               0.000000
poutcome               0.817470
term_deposit           0.000000
date_joined            0.000664
device                 0.002079
dtype: float64

In [29]:
users_data[users_data.poutcome.isnull()]

,user_id,number_transactions,total_amount_usd,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,term_deposit,date_joined,device
0,9231c446-cb16-4b2b-a7f7-ddfc8b25aaf6,3.0,2143.0,58,management,married,tertiary,False,True,False,None,261,1,-1,0,None,False,1998-08-23,mobile
1,bb92765a-08de-4963-b432-496524b39157,NaN,NaN,44,technician,single,secondary,False,True,False,None,151,1,-1,0,None,False,2008-07-15,desktop
2,573de577-49ef-42b9-83da-d3cfb817b5c1,2.0,2.0,33,entrepreneur,married,secondary,False,True,True,None,76,1,-1,0,None,False,2002-06-04,mobile
3,d6b66b9d-7c8f-4257-a682-e136f640b7e3,NaN,NaN,47,blue-collar,married,None,False,True,False,None,92,1,-1,0,None,False,1995-06-29,tablet
4,fade0b20-7594-4d9a-84cd-c02f79b1b526,1.0,1.0,33,None,single,None,False,False,False,None,198,1,-1,0,None,False,1995-08-01,mobile
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45208,240bce69-b3eb-49c6-9a61-f0684b919d7a,2.0,113.0,23,student,single,tertiary,False,False,False,cellular,266,1,-1,0,None,True,1997-02-09,desktop
45210,6ace2eec-d1a9-4ea6-810d-4acb56fd00ab,3.0,505.0,25,technician,single,secondary,False,False,True,cellular,386,2,-1,0,None,True,2007-08-30,tablet
45211,a218c1d6-880a-4431-a314-a1bd3dc36b21,2.0,825.0,51,technician,married,tertiary,False,False,False,cellular,977,3,-1,0,None,True,2002-12-28,desktop
45212,6a6bf402-9416-4e71-97c6-727e8298a3a5,4.0,1729.0,71,retired,divorced,primary,False,False,False,cellular,456,2,-1,0,None,True,2010-11-18,desktop
45214,44623a48-4e9b-48fd-b155-a17d1c06a754,NaN,NaN,57,blue-collar,married,secondary,False,False,False,telephone,508,4,-1,0,None,False,1996-09-14,desktop

In [37]:
def identify_missing_data(df):
    """
    This function is used to identify missing data
    
    @param df pandas DataFrame
    
    @return a DataFrame with the percentage of missing data for every feature and the data types
    """
    
    percent_missing = df.isnull().mean()
    
    missing_value_df = pd.DataFrame(percent_missing).reset_index() # convert to DataFrame
    missing_value_df = missing_value_df.rename(columns = {"index" : "variable",
                                                                0 : "percent_missing"}) # rename columns

    missing_value_df = missing_value_df.sort_values(by = ['percent_missing'], ascending = False) # sort the values
    
    data_types_df = pd.DataFrame(df.dtypes).reset_index().rename(columns = {"index" : "variable",
                                                                0 : "data_type"}) # rename columns
    
    missing_value_df = missing_value_df.merge(data_types_df, on = "variable") # join the dataframe with datatype
    
    missing_value_df.percent_missing = round(missing_value_df.percent_missing*100, 2) # format the percent_missing
    
    return missing_value_df[missing_value_df.percent_missing > 0]

In [39]:
missing_data = identify_missing_data(users_data)

In [40]:
missing_data

              variable  percent_missing       data_type
0             poutcome            81.75          object
1              contact            28.80          object
2  number_transactions            22.12         float64
3     total_amount_usd            22.12         float64
4            education             4.11          object
5                  job             0.64          object
6               device             0.21          object
7          date_joined             0.07  datetime64[ns]

In [42]:
# question: how many columns contain missing data

# option 1 
missing_data.shape[0]

8

In [44]:
len(missing_data)

8

In [45]:
print("# of columns with missing data", missing_data.shape[0])

# of columns with missing data 8

In [47]:
missing_data[missing_data.data_type == 'float64']

              variable  percent_missing data_type
2  number_transactions            22.12   float64
3     total_amount_usd            22.12   float64

In [49]:
missing_data[missing_data.data_type == 'float64'].shape[0]

2

In [51]:
print("# of columns with missing data and data type float:", missing_data[missing_data.data_type == 'float64'].shape[0])

# of columns with missing data and data type float: 2

In [52]:
# how many columns contain missing data and have the data type object??

missing_data[missing_data.data_type == 'object']

    variable  percent_missing data_type
0   poutcome            81.75    object
1    contact            28.80    object
4  education             4.11    object
5        job             0.64    object
6     device             0.21    object

In [53]:
missing_data[missing_data.data_type == 'object'].shape[0]

5

In [54]:
print("# of columns with missing data and data type object:", missing_data[missing_data.data_type == 'object'].shape[0])

# of columns with missing data and data type object: 5

In [63]:
# question: identify the column that has more than 70% missing data

list(missing_data[missing_data.percent_missing > 70].variable)

['poutcome']

In [61]:
len(list(missing_data[missing_data.percent_missing > 70].variable))

1

In [64]:
# transformation task - drop the columns with more than 70% missing data
# option 1
users_data_transformed = users_data.drop(['poutcome'], axis=1)

In [66]:
# option 2

cols_to_drop = list(missing_data[missing_data.percent_missing > 70].variable)
cols_to_drop

['poutcome']

In [67]:
users_data_transformed = users_data.drop(cols_to_drop, axis=1)

In [68]:
identify_missing_data(users_data_transformed)

              variable  percent_missing       data_type
0              contact            28.80          object
1  number_transactions            22.12         float64
2     total_amount_usd            22.12         float64
3            education             4.11          object
4                  job             0.64          object
5               device             0.21          object
6          date_joined             0.07  datetime64[ns]

In [69]:
print(users_data.shape)
print(users_data_transformed.shape)

(45209, 19)
(45209, 18)

In [70]:
# saving our dataframe to a location

users_data_transformed.to_pickle("../data/users_data_transformed.pkl")

In [72]:
check = pd.read_pickle("../data/users_data_transformed.pkl")
check.head()

,user_id,number_transactions,total_amount_usd,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,term_deposit,date_joined,device
0,9231c446-cb16-4b2b-a7f7-ddfc8b25aaf6,3.0,2143.0,58,management,married,tertiary,False,True,False,None,261,1,-1,0,False,1998-08-23,mobile
1,bb92765a-08de-4963-b432-496524b39157,NaN,NaN,44,technician,single,secondary,False,True,False,None,151,1,-1,0,False,2008-07-15,desktop
2,573de577-49ef-42b9-83da-d3cfb817b5c1,2.0,2.0,33,entrepreneur,married,secondary,False,True,True,None,76,1,-1,0,False,2002-06-04,mobile
3,d6b66b9d-7c8f-4257-a682-e136f640b7e3,NaN,NaN,47,blue-collar,married,None,False,True,False,None,92,1,-1,0,False,1995-06-29,tablet
4,fade0b20-7594-4d9a-84cd-c02f79b1b526,1.0,1.0,33,None,single,None,False,False,False,None,198,1,-1,0,False,1995-08-01,mobile